# （1）一只青蛙一次可以跳上 1 级台阶，也可以跳上2 级。求该青蛙跳上一个n 级的台阶总共有多少种跳法。
#（2）一只青蛙一次可以跳上1级台阶，也可以跳上2 级……它也可以跳上n 级，此时该青蛙跳上一个n级的台阶总共有多少种跳法？

# 先看原问题
# f(0) : 1
# f(1) : 1
# f(2) : f(1) + f(0)
# f(3) : f(2) + f(1)
# f(4) : f(3) + f(2)
# ...
# f(k) : f(k-1) + f(k-2)


def get_count_jump(k):
    if k < 0:
        return None
    elif k == 0:
        return 1
    elif k == 1:
        return 1
    else:
        return get_count_jump(k - 1) + get_count_jump(k - 2)


print(get_count_jump(6))

# 拓展问题
# f(0) : 1
# f(1) : 1
# f(2) : f(1) + f(0)
# f(3) : f(2) + f(1) + f(0)
# f(4) : f(3) + f(2) + f(1) + f(0)
# ...
# f(k-1) : f(k-2) + ...+ f(1) + f(0)
# f(k) : f(k-1) + f(k-2) + ... + f(1) + f(0)
# -->f(k) = 2 * f(k-1)

# 所以也就没有代码量了,就是一个数学映射
